// Даны два числа. Показать большее и меньшее число

int number1 = 12;
int number2 = 256;

if (number1 < number2)
{
    System.Console.WriteLine(number2);
}
else
{
    System.Console.WriteLine(number1);
}